tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SPDIF.h
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_SHIFT (0U)
/*! RxCChannel_Addr_159_128 - RxCChannel_Addr_159_128 */
#define SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_SHIFT)) & SPDIF_SPDIFRXCCHANNEL_ADDR_159_128_RXCCHANNEL_ADDR_159_128_MASK)
/*! @} */

/*! @name SPDIFRXCCHANNEL_ADDR_191_160 - SPDIF receive C channel register, bits 191-160 */
/*! @{ */

#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_SHIFT (0U)
/*! RxCChannel_Addr_191_160 - RxCChannel_Addr_191_160 */
#define SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_SHIFT)) & SPDIF_SPDIFRXCCHANNEL_ADDR_191_160_RXCCHANNEL_ADDR_191_160_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_31_0 - SPDIF transmit C channel register, bits 31-0 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_SHIFT (0U)
/*! TxCChannel_Addr_31_0 - TxCChannel_Addr_31_0 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_31_0_TXCCHANNEL_ADDR_31_0_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_63_32 - SPDIF transmit C channel register, bits 63-32 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_SHIFT (0U)
/*! TxCChannel_Addr_63_32 - TxCChannel_Addr_63_32 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_63_32_TXCCHANNEL_ADDR_63_32_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_95_64 - SPDIF transmit C channel register, bits 95-64 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_SHIFT (0U)
/*! TxCChannel_Addr_95_64 - TxCChannel_Addr_95_64 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_95_64_TXCCHANNEL_ADDR_95_64_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_127_96 - SPDIF transmit C channel register, bits 127-96 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_SHIFT (0U)
/*! TxCChannel_Addr_127_96 - TxCChannel_Addr_127_96 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_127_96_TXCCHANNEL_ADDR_127_96_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_159_128 - SPDIF transmit C channel register, bits 159-128 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_SHIFT (0U)
/*! TxCChannel_Addr_159_128 - TxCChannel_Addr_159_128 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_159_128_TXCCHANNEL_ADDR_159_128_MASK)
/*! @} */

/*! @name SPDIFTXCCHANNEL_ADDR_191_160 - SPDIF transmit C channel register, bits 191-160 */
/*! @{ */

#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_MASK (0xFFFFFFFFU)
#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_SHIFT (0U)
/*! TxCChannel_Addr_191_160 - TxCChannel_Addr_191_160 */
#define SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160(x) (((uint32_t)(((uint32_t)(x)) << SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_SHIFT)) & SPDIF_SPDIFTXCCHANNEL_ADDR_191_160_TXCCHANNEL_ADDR_191_160_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SPDIF_Register_Masks */


/*!
 * @}
 */ /* end of group SPDIF_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SPDIF_H_ */

